/* global require module */
'use strict';

module.exports = require('translitit-engine')({
    'i': 'ი',
    'e': 'ე',
    'a': 'ა',
    'o': 'ო',
    'u': 'უ',

    'p': 'პ',
    'p\'': 'ფ',
    'p’': 'ფ',
    'ph': 'ფ',
    'f': 'ფ',
    'b': 'ბ',
    'v': 'ვ',
    'w': 'ვ',
    'm': 'მ',

    't': 'ტ',
    't\'': 'თ',
    't’': 'თ',
    'th': 'თ',
    'd': 'დ',
    'n': 'ნ',
    's': 'ს',
    'z': 'ზ',
    'ts': 'წ',
    'ts\'': 'ც',
    'ts’': 'ც',
    'dz': 'ძ',
    'sh': 'შ',
    'zh': 'ჟ',
    'ch': 'ჭ',
    'ch\'': 'ჩ',
    'ch’': 'ჩ',
    'j': 'ჯ',
    'r': 'რ',
    'l': 'ლ',

    'k': 'კ',
    'k\'': 'ქ',
    'k’': 'ქ',
    'g': 'გ',
    'gh': 'ღ',
    'kh': 'ხ',
    'x': 'ხ',

    'q\'': 'ყ',
    'q’': 'ყ',
    'q': 'ყ',
    'h': 'ჰ'
});
